система_реагирования_на_ЧС/src/Documents/ПоступлениеРесурсов/ПоступлениеРесурсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеРесурсов</name>
  <registerRecords>AccumulationRegister.ОстаткиРесурсов</registerRecords>
  <tabularSections>
    <name>СписокРесурсов</name>
    <attributes>
      <name>Ресурс</name>
      <type>
        <types>CatalogRef.СписокРесурсов</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

система_реагирования_на_ЧС/src/AccumulationRegisters/ОстаткиРесурсов/ОстаткиРесурсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиРесурсов</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Ресурс</name>
    <type>
      <types>CatalogRef.СписокРесурсов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

система_реагирования_на_ЧС/src/Documents/ПоступлениеРесурсов/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ,Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр ОстаткиРесурсов
	Движения.ОстаткиРесурсов.Записывать = Истина;
	Для Каждого ТекСтрокаСписокРесурсов из СписокРесурсов Цикл
		Движение = Движения.ОстаткиРесурсов.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Ресурс = ТекСтрокаСписокРесурсов.Ресурс;
		Движение.Количество = ТекСтрокаСписокРесурсов.Количество;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
